police/vehicles/src/main/resources/requestGetVehicle.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.police.org">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getVehicleRequest>
            <gs:name>Kia Sportage</gs:name>
        </gs:getVehicleRequest>
    </soapenv:Body>
</soapenv:Envelope>